#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.github_repo["go-api-hello-world"].github_repository.repo: Refreshing state... [id=go-api-hello-world]
module.github_repo["frajer"].github_repository.repo: Refreshing state... [id=frajer]
module.github_repo["vaclav-dvorak"].github_repository.repo: Refreshing state... [id=vaclav-dvorak]
module.github_repo["anna-helmova"].github_repository.repo: Refreshing state... [id=anna-helmova]
module.github_repo["vccsturm"].github_repository.repo: Refreshing state... [id=vccsturm]
module.github_repo["summit-formule"].github_repository.repo: Refreshing state... [id=summit-formule]
module.github_repo["summit-pokemon"].github_repository.repo: Refreshing state... [id=summit-pokemon]
module.github_repo["game-of-life"].github_repository.repo: Refreshing state... [id=game-of-life]
module.github_repo["dpd-test"].github_repository.repo: Refreshing state... [id=dpd-test]
module.github_repo["roguna"].github_repository.repo: Refreshing state... [id=roguna]
module.github_repo["maze"].github_repository.repo: Refreshing state... [id=maze]
module.github_repo["go101"].github_repository.repo: Refreshing state... [id=go101]
module.github_repo["bara"].github_repository.repo: Refreshing state... [id=bara]
module.github_repo["devops-workshop"].github_repository.repo: Refreshing state... [id=devops-workshop]
module.github_repo["mefbox"].github_repository.repo: Refreshing state... [id=mefbox]
module.github_repo["fiddo"].github_repository.repo: Refreshing state... [id=fiddo]
module.github_repo["apprepo-dash"].github_repository.repo: Refreshing state... [id=apprepo-dash]
module.github_repo["toulky"].github_repository.repo: Refreshing state... [id=toulky]
module.github_repo["wsl-setup"].github_repository.repo: Refreshing state... [id=wsl-setup]
module.github_repo["toulky"].github_branch.main: Refreshing state... [id=toulky:main]
module.github_repo["go-api-hello-world"].github_branch.main: Refreshing state... [id=go-api-hello-world:main]
module.github_repo["vaclav-dvorak"].github_branch.main: Refreshing state... [id=vaclav-dvorak:main]
module.github_repo["dpd-test"].github_branch.main: Refreshing state... [id=dpd-test:main]
module.github_repo["game-of-life"].github_branch.main: Refreshing state... [id=game-of-life:main]
module.github_repo["maze"].github_branch.main: Refreshing state... [id=maze:main]
module.github_repo["fiddo"].github_branch.main: Refreshing state... [id=fiddo:main]
module.github_repo["mefbox"].github_branch.main: Refreshing state... [id=mefbox:main]
module.github_repo["summit-formule"].github_branch.main: Refreshing state... [id=summit-formule:main]
module.github_repo["devops-workshop"].github_branch.main: Refreshing state... [id=devops-workshop:main]
module.github_repo["anna-helmova"].github_branch.main: Refreshing state... [id=anna-helmova:main]
module.github_repo["vccsturm"].github_branch.main: Refreshing state... [id=vccsturm:main]
module.github_repo["apprepo-dash"].github_branch.main: Refreshing state... [id=apprepo-dash:main]
module.github_repo["bara"].github_branch.main: Refreshing state... [id=bara:main]
module.github_repo["wsl-setup"].github_branch.main: Refreshing state... [id=wsl-setup:main]
module.github_repo["go101"].github_branch.main: Refreshing state... [id=go101:main]
module.github_repo["summit-pokemon"].github_branch.main: Refreshing state... [id=summit-pokemon:main]
module.github_repo["frajer"].github_branch.main: Refreshing state... [id=frajer:main]
module.github_repo["anna-helmova"].github_branch_default.main: Refreshing state... [id=anna-helmova]
module.github_repo["wsl-setup"].github_branch_default.main: Refreshing state... [id=wsl-setup]
module.github_repo["fiddo"].github_branch_default.main: Refreshing state... [id=fiddo]
module.github_repo["go101"].github_branch_default.main: Refreshing state... [id=go101]
module.github_repo["frajer"].github_branch_default.main: Refreshing state... [id=frajer]
module.github_repo["toulky"].github_branch_default.main: Refreshing state... [id=toulky]
module.github_repo["apprepo-dash"].github_branch_default.main: Refreshing state... [id=apprepo-dash]
module.github_repo["dpd-test"].github_branch_default.main: Refreshing state... [id=dpd-test]
module.github_repo["bara"].github_branch_default.main: Refreshing state... [id=bara]
module.github_repo["devops-workshop"].github_branch_default.main: Refreshing state... [id=devops-workshop]
module.github_repo["maze"].github_branch_default.main: Refreshing state... [id=maze]
module.github_repo["summit-formule"].github_branch_default.main: Refreshing state... [id=summit-formule]
module.github_repo["summit-pokemon"].github_branch_default.main: Refreshing state... [id=summit-pokemon]
module.github_repo["mefbox"].github_branch_default.main: Refreshing state... [id=mefbox]
module.github_repo["vccsturm"].github_branch_default.main: Refreshing state... [id=vccsturm]
module.github_repo["vaclav-dvorak"].github_branch_default.main: Refreshing state... [id=vaclav-dvorak]
module.github_repo["game-of-life"].github_branch_default.main: Refreshing state... [id=game-of-life]
module.github_repo["go-api-hello-world"].github_branch_default.main: Refreshing state... [id=go-api-hello-world]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.github_repo["roguna"].github_branch.main will be created
  + resource "github_branch" "main" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "roguna"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.github_repo["roguna"].github_branch_default.main will be created
  + resource "github_branch_default" "main" {
      + branch     = "main"
      + id         = (known after apply)
      + repository = "roguna"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```

</details>

*Pusher: @vaclav-dvorak, Action: `pull_request`*